Revit 2024 API
Camera Class
 A collection of camera settings for the current view.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class Camera : IDisposable
Visual Basic
Public Class Camera _
	Implements IDisposable
Visual C++
public ref class Camera : IDisposable
Remarks
 The current Camera can be obtained from DrawContext
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.Camera
See Also
Camera Members
Autodesk.Revit.DB.DirectContext3D Namespace